<?php

namespace App\Providers;

use App\Models\Contract;
use App\Repositories\Contract\ContractRepo;
use App\Repositories\Contract\ContractRepoInterface;
use App\Services\ContractService;
use Illuminate\Notifications\DatabaseNotification;
use Illuminate\Pagination\Paginator;
use Illuminate\Support\Facades\Schema;
use Illuminate\Support\Facades\View;
use Illuminate\Support\ServiceProvider;

class AppServiceProvider extends ServiceProvider
{
    /**
     * Register any application services.
     */
    public function register(): void
    {

    }

    /**
     * Bootstrap any application services.
     */
    public function boot(): void
    {
        Schema::defaultStringLength('190');
        Paginator::useBootstrap();

        View::composer('admin.layouts.template.navbar', function ($view) {
            $data = [
                'notifications' => DatabaseNotification::all(),
            ];
            $view->with($data);
        });

        View::composer('admin.dashboard.layouts.overal', function ($view) {
            $motivationalQuotes = collect([
                "تلاش بی‌وقفه، کلید موفقیت است.",
                "تغییرات کوچک می‌توانند به تغییرات بزرگی منجر شوند.",
                "تجربه‌ی شکست، پله‌ی اول موفقیت است.",
                "همیشه به آینده امیدوار باش و در گذشته یادگیری کن.",
                "بزرگترین ریسک، ریسک نکردن است! در این دنیا که به سرعت تغییر می کند، تنها استراتژی که شکست را تضمین می کند، ریسک نکردن است. “مارک زاکربرگ”",
                "نبوغ یک درصد الهام روح و نود و نه درصد عرق ریختن است. توماس ادیسون",
                "پیشرفت، خودتان را به تدریج به سمت اهدافتان می‌برد.",
                "از هیچ چیز پشیمان نباشید، زیرا آنها تجربه‌های شماست.",
                "بزرگترین مانع در رسیدن به اهداف، ترس از شکست است.",
                "تغییر دادن تغییر را به همراه دارد. بگذارید جرأت داشته باشید تا تغییر را خوشبختی بیابید.",
                "زمانی که به اهدافتان پایبندید، راه‌های نیابتی برای دستیابی به آنها پیدا خواهید کرد.",
                "مسیر به سوی موفقیت پر از چالش‌هاست. از آنها یاد بگیرید و پیش بروید.",
                "همیشه به خودتان اعتماد کنید، زیرا شما توانایی‌هایی دارید که تا به حال نادیده گرفته‌اید.",
                "رنگ زندگی خود را خودتان تعیین کنید، نه دیگران.",
                "شجاعت، مقابله با ترس و سلطه بر آن است نه فقدانِ ترس.",
                "موفقیت، مجموعه‌ای از تلاش‌های کوچک است که هر روز و هر روز تکرار شده‌اند",
                "فرصت‌ها اتفاق نمی‌افتند، شما خالق آنها هستید. کریس گروسر",
                "روشن و قطعی بودن هدف نقطه‌ی شروع تمام موفقیت‌هاست. دابلیو کلمنت استون",
                "موفقیت در پشت آرزوها و تصمیم‌های جسورانه پنهان است.",
                "کارهای بزرگ از کارهای کوچکی آغاز می‌شوند. پس شروع کنید.",
                "به دیگران کمک کنید و به دنیای بهتری تبدیل شوید.",
                "رؤیاهای‌ خودتان را بسازید در غیر این صورت فرد دیگری شما را برای ساختن رؤیایش به کار خواهد گرفت. فرا گری",
                "هر روز، فرصتی برای شروع دوباره است.",
                "موفقیت نهایی در ادامه تلاش و عدم تسلیم به شکست است.",
                "همیشه به آنچه که می‌خواهید باور کنید و به آن دست پیدا کنید.",
                "تغییرات درونی شما تغییرات بزرگی در زندگی شما ایجاد می‌کنند.",
                "هر روز فرصت جدیدی است تا یک قدم دیگر به سوی آرزوهایتان برداشته باشید.",
                "پیشرفت کوچک، همچنان پیشرفت است.",
                "موفقیت، به همراهی تصمیم، تلاش، و ایمان به خودتان است.",
                "اگر جاده ای پیدا کردید که هیچ مانعی در آن نبود، به احتمال زیاد آن جاده به جایی نمی رسد. “فرانک کلارک”",
                "مکث کن، نفس بکش، اگر باید گریه کنی اینکارو بکن، ولی هیچ وقت نا امید نشو و به راهت ادامه بده.",
                "هرگز تسلیم نشوید، امروز سخت است و فردا سخت تر، اما پس فردا روز روشنی برای تان خواهد بود. “جک ما”",
                "فهمیده‌ام هر چقدر سخت‌تر کار می‌کنم، انگار شانس بیشتری به سراغم می‌آید.",
                "از شکست نترسید، این بخشی از زندگی است.",
                "به خودتان ایمان داشته باشید و می توانید هر کاری که می خواهید انجام دهید.",
                "روی ارزش های خود تمرکز کنید و از آنها دفاع کنید.",
                "از زندگی لذت ببرید و هر لحظه را گرامی بدارید.",
                "قدردان داشته های خود باشید و برای آنچه دارید سپاسگزار باشید.",
                "به دیگران مهربان باشید و دنیا را مکانی بهتر کنید.",
                "پیشرفت روزانه کوچک، در طولانی مدت منجر به نتایج خیره‌ کننده خواهد شد. رابین شارما",
                "هر کسی که توانسته است چیزی را بسازد، حتما نظم و انضباط داشته است. اندرو هندریکسون",
                "موفقیت در این نیست که چه چیزی در پیش رو داریم، موفقیت در این است که چه چیزی در پشت سر به جا می‌گذاریم. کریس ماسگرو",
                "تنها در فرهنگ لغت می‌توانید پیروزی را پیش از عمل ببینید. وایدال سَسون",
                "موفقیت خود را به این نسبت می‌دهم که من هرگز نه بهانه آوردم و نه بهانه‌ای را پذیرفتم. فلورانس نایتینگل",
                "با انگیزه بودن هیچ هزینه‌ای برای‌تان ندارد اما می‌تواند همه چیز را برای شما فراهم کند. موری نیولند",
                "آنچه ما امتحان‌هایی سخت می‌پنداریم‌شان غالبا موهبت‌هایی با لباس مبدل‌اند. اسکار وایلد",
                "موفقیت عبارت است از رفتن از شکست به شکست دیگر بدون از دست دادن اشتیاق. وینستون چرچیل",
                "ترجیح می‌دهم از اشتیاق بمیرم تا از ملالت. وینسنت ون ‌گوگ",
                "برای چیزی که پنج سال دیگه ارزشی نداره بیشتر از پنج دقیقه غصه نخور.",
                "زندگی هر چقدر هم بد به نظر برسد، باز هم کاری وجود دارد که می‌توانی انجام دهی و در آن موفق شوی. استیون‌ هاوکینگ",
            ]);
            $data               = [
                'motivationalQuote' => $motivationalQuotes->random(),
            ];
            $view->with($data);
        });


        if (!session()->has('pagination')) {
            session()->put('pagination', 50);
        }


        // $this->app->bind(ContractService::class, function ($app) {
        //     return new ContractService(new ContractRepo(new Contract()));
        // });
    }
}
